{"pageProps":{"post":{"type":"file","path":"index","content":{"attributes":{"title":"The lifetime of a script","date":"Sat Oct 31 2020 21:21:31 GMT+0800 (China Standard Time)"},"body":"<p>When web browser loads a webpage, a document is created, parsed, until it is fully loaded. During these phases, the javascript programs are first synchrounously loaded and excuted and then transit into an event-handling asynchrounous execution. </p>\n<h2 id=\"step-1-loading-the-document\">Step 1: Loading the document</h2>\n<p>Before the web browser starts parsing a web page, it will first creates a document object. <em><strong>the browser set document.readyState property to be loading</strong></em>. As the parser scan through the webpage, dom element objects will be added to the document object in the order that the parser encounters them. </p>\n<p>When the HTML parser encounters a &lt;script&gt; tag. There are a few scenarios might happen during this phase:</p>\n<h3 id=\"1-inline-script\">1. inline script</h3>\n<p>If it is an inline &lt;script&gt; tag or &lt;script\\ src=&quot;&quot;&gt; tag without async, defer, or type=&quot;module&quot; attributes, the script element will be added to document just like any other dom elements. It will also be exectued synchronously in the same order the parser encounters them. The script will have access to its own &lt;script&gt; tag and document content that comes before itself. Before the script is fully loaded and excuted, the Html parser cannot proceed the dom construction. Because the script can call document.write() function which would totally change the whole document structure, which renders the dom parser work totally pointless.</p>\n<h3 id=\"2-async-script\">2. async script</h3>\n<p>When the parser encounters a &lt;script&gt; that has async attribute set, it begin downloading the script text and continues parsing the rest of document. After the script content is downloaded, it will be executed. Once it is downloaded they behave pretty much the same as inline &lt;script&gt; tag.</p>\n<p><em>Do note that it is highly possible that the parser might already parsed the whole document by the time the async script is downloaded (might happen in step 2 or even step 3), in which case, the (async) script will have the whole access to the whole document object.</em></p>\n<h3 id=\"3-module-script\">3. module script</h3>\n<p>a module script is a script with type=&quot;module&quot; attribute set. It behaves the same as async script, with one difference that when the browser begins downloading the script, it will also download all of the script’s dependencies. while the parser continues to parsing the document.</p>\n<h2 id=\"step-2-document-is-parsed\">Step 2: document is parsed</h2>\n<p>When the document is completely parsed, <em><strong>the document.readyState property\nchanges to “interactive.”</strong></em></p>\n<p>At this phase, any script with defer attribute set (along with any module scripts that do not have an async attribute) are executed in the order in which they appeared in the document.Deferred scripts have access to the complete document.</p>\n<h2 id=\"step-3-document-is-ready\">Step 3: document is ready</h2>\n<p>The browser fires a “DOMContentLoaded” event on the Document object. <em><strong>This\nmarks the transition from synchronous script-execution phase to the\nasynchronous, event-driven phase of program execution</strong></em>. Only async script might still haven&#39;t be exectued at this phase (might because of slow internet speed or script file too large so it takes too long to download)</p>\n<p>The browser may still be waiting for additional content, such as images, to load. When all such content finishes loading, and when all async scripts have loaded and executed, <em><strong>the document.readyState property changes to “complete” and the web browser fires\na “load” event on the Window object</strong></em>.</p>\n<p>From this point on, event handlers are invoked asynchronously in response to\nuser input events, network events, timer expirations, and so on.</p>\n<blockquote>\n<p>Reference: Javascript: The Definitive Guide, 7th Edition</p>\n</blockquote>\n","bodyBegin":6,"frontmatter":"title: The lifetime of a script\ndate: 2020-10-31T13:21:31.324Z"},"isIndex":true}},"__N_SSG":true}